In [2]:
import pandas as pd

In [4]:
import numpy as np

In [9]:
rng=np.random.RandomState(42)
ser=pd.Series(rng.randint(0,10,5))

In [19]:
ser   #series相当于numpy的一维数组

0    6
1    3
2    7
3    4
4    6
dtype: int32

In [21]:
df=pd.DataFrame(rng.randint(0,10,(3,4)),columns=['a','b','c','d'],index=[1,2,3])
df  #dataframe相当于numpy中的二维数组

   a  b  c  d
1  9  3  7  6
2  8  7  4  1
3  4  7  9  8

In [23]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
4     403.428793
dtype: float64

In [25]:
np.sin(df*np.pi/4)

              a         b             c             d
1  7.071068e-01  0.707107 -7.071068e-01 -1.000000e+00
2 -2.449294e-16 -0.707107  1.224647e-16  7.071068e-01
3  1.224647e-16 -0.707107  7.071068e-01 -2.449294e-16

In [27]:
np.cos(df*np.pi/4)

          a         b         c             d
1  0.707107 -0.707107  0.707107 -1.836970e-16
2  1.000000  0.707107 -1.000000  7.071068e-01
3 -1.000000  0.707107  0.707107  1.000000e+00

通用函数，索引对齐

In [35]:
weight=pd.Series({'lucy':60,'lily':65})

In [46]:
height=pd.Series({'lorual':160,'jack':180,'lucy':0})

In [47]:
rate=weight/height
rate

jack      NaN
lily      NaN
lorual    NaN
lucy      inf
dtype: float64

结果数组的索引是两个数组索引的并集

In [44]:
rate.index

Index(['jack', 'lily', 'lorual', 'lucy'], dtype='object')

In [48]:
weight.index|height.index

Index(['jack', 'lily', 'lorual', 'lucy'], dtype='object')

In [49]:
a=pd.Series([2,4,6],index=[0,1,2])

In [52]:
b=pd.Series([1,3,5,],index=[1,2,3])

In [53]:
a+b

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [57]:
a.add(b,fill_value=0) 
#使用.add方法时，可以在计算时，将索引对齐后，将缺失值补充为0在进行相加。

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

dataframe索引对齐

In [121]:
rng=np.random.RandomState(43)

In [122]:
c=pd.DataFrame(rng.randint(0,10,(3,4)),columns=list('ABCD'))
c

   A  B  C  D
0  4  0  1  5
1  0  3  1  2
2  7  0  3  2

In [123]:
d=pd.DataFrame(rng.randint(0,10,(2,5)),columns=list('BACDE'))
d

   B  A  C  D  E
0  9  1  2  2  3
1  5  4  4  0  5

In [124]:
c+d 
#dataframe数据计算时，不仅会将行索引对齐,也会将列索引对齐。
#而且索引顺序不同时，结果会按照顺序自动排序.

     A    B    C    D   E
0  5.0  9.0  3.0  7.0 NaN
1  4.0  8.0  5.0  2.0 NaN
2  NaN  NaN  NaN  NaN NaN

In [126]:
fill=c.stack().mean()

In [127]:
fill

2.3333333333333335

In [138]:
h=c.add(d,fill_value=fill)
h

      A    B    C    D    E
0   5.0  9.0  3.0  7.0  7.5
1   4.0  8.0  5.0  2.0  9.5
2  11.5  4.5  7.5  6.5  NaN

In [143]:
h.ix[2,4]#此处为何，是nan.

nan

In [144]:
a=[1,5]
b=[11,1]

In [145]:
e=pd.DataFrame({'A':a,'B':b})
e

   A   B
0  1  11
1  5   1

In [146]:
a1=[4,5,9]
b1=[0,8,2]
c1=[9,0,6]

In [147]:
f=pd.DataFrame({'B':a1,'A':b1,'C':c1})
f

   A  B  C
0  0  4  9
1  8  5  0
2  2  9  6

In [134]:
fill=e.stack().mean()
fill

4.5

In [148]:
e.add(f,fill_value=fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

In [152]:
a=rng.randint(10,size=(3,4))
a

array([[8, 7, 3, 6],
       [3, 2, 4, 2],
       [7, 3, 6, 8]])

In [166]:
a-a[0] #numpy二维数组的广播规则

array([[ 0,  0,  0,  0],
       [-5, -5,  1, -4],
       [-1, -4,  3,  2]])

In [168]:
df=pd.DataFrame(a,columns=list('ABCD'))
df

   A  B  C  D
0  8  7  3  6
1  3  2  4  2
2  7  3  6  8

In [170]:
df-df.iloc[0]

   A  B  C  D
0  0  0  0  0
1 -5 -5  1 -4
2 -1 -4  3  2

In [174]:
df.subtract(df['A'],axis=0)

   A  B  C  D
0  0 -1 -5 -2
1  0 -1  1 -1
2  0 -4 -1  1

In [185]:
halfrow=df.iloc[0,::2]
halfrow

A    8
C    3
Name: 0, dtype: int32

In [186]:
df-halfrow#halfrow会先向下广播，计算时在列方向上进行索引对齐。

     A   B    C   D
0  0.0 NaN  0.0 NaN
1 -5.0 NaN  1.0 NaN
2 -1.0 NaN  3.0 NaN